Autodesk.Revit.UI.NumberingUIManager.GetFilterList(Autodesk.Revit.DB.Document)
document:
Target document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.NumberingUIManager.DisplayProjectFiltersDialog(Autodesk.Revit.DB.Document)
Display the view filter customization dialog.
document:
Target document.
Returns:
Returns true if the operation requieres the transaction to be commited.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.NumberingUIManager.RegisterExtCallback(Autodesk.Revit.UI.INumberingUICallback)
Set the external callback.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.UI.NumberingUIManager.GetCallback
Get the current external callback.
Since:
2027

Autodesk.Revit.UI.NumberingUIManager.GetInstance
Get a reference to the NumberingUIManager singleton.
Since:
2027

Autodesk.Revit.UI.NumberingUIManager.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.NumberingUIManager
General Numbering UI manager for Revit.
Since:
2027